{
	"headings":[
		{
			"title":"User Experience",
			"titleDesc":"User research and analysis helps you identify your customers needs and helps you fill the gaps before a competitor steals your loyal customers.",
			"key":"ux"
		},
		{
			"title":"Prototyping",
			"titleDesc":"Design before you code. This has now become my motto. Early prototyping can help save significant amount of development time and effort.",
			"key":"prototyping"
		},
		{
			"title":"Design",
			"titleDesc":" I mainly create vector graphics for most of my wireframes and prototypes.",
			"key":"design"
		},
		{
			"title":"Development",
			"titleDesc":"I have spent considerable time learning web development and I use it to my best advantage when I need to create interactive prototypes. The web has become such an exciting new place that its not possible to not get involved in creating for the web.",
			"key":"development"
		},
		{
			"title":"Tools",
			"titleDesc":" Over the years, there are certain tools that I have grown to love, admire (and hate as well).",
			"key":"tools"
		}
	],
	"skills":[
		{
			"name":"Usability",
			"description":"I am firm believer in the power of compounding. Tiny problems in an interface, if performed repeatedly enough, can compound to create frustrating user experiences. I focus on those tiny problems and get them out of the way. I specialize in conducting Heuristic Evaluation and Cognitive Walkthroughs.",
			"type":"User Experience","key":"ux",
			"Keywords":[],
			"urls":{
				"Heuristic Evaluation":"http://www.nngroup.com/articles/ten-usability-heuristics/",
				"Cognitive Walkthroughs":"http://www.sigchi.org/chi95/proceedings/tutors/jr_bdy.htm"
			}
		},
		{
			"name":"User Studies",
			"description":"The best way to solve a problem is to solve the right problem. User studies like contextual inquiry, interviews and usability testing help bring out hidden flaws and identify opportunities for innovation.",
			"type":"User Experience","key":"ux",
			"Keywords":[],
			"urls":{
				"contextual inquiry":"http://www.usabilitynet.org/tools/contextualinquiry.htm"
			}
		},
		{
			"name":"Wireframing",
			"description":"There comes a times when you have an epiphany and there comes a time when you have to show it to people so that they may see to believe. But you dont write code to do that. You wireframe, throw around ideas, crush some papers before you head on to burning the midnight oil.",
			"type":"User Experience","key":"ux",
			"Keywords":[],
			"urls":{
				"wireframe":"http://en.wikipedia.org/wiki/Website_wireframe"
			}
		},
		{
			"name":"Prototyping",
			"description":"Websites wireframes are good. But sometimes you need more interaction than what a wireframe offers. I have built elaborate interactive paper prototypes(yes, interactive) and have also built prototypes using frameworks like Twitter Bootstrap and jQueryUI.",
			"type":"User Experience","key":"ux",
			"Keywords":[],
			"urls":{
			}
		},
		{
			"name":"Bootstrap",
			"description":"A prototyper's best friend. Ive used both Bootstrap 2.3 and Bootstrap 3.0 for conducting several online research studies at the IU Human Computer Interaction labs",
			"type":"Prototyping","key":"prototyping",
			"Keywords":[],
			"urls":{
				"Bootstrap 2.3":"http://getbootstrap.com/2.3.2/",
				"Bootstrap 3.0":"http://getbootstrap.com/"
			}
		},
		{
			"name":"Axure",
			"description":"I was introduced to this beast when I joined my HCI program. I used it for a few class projects for creating prototypes. Its a pretty amazing tool and really got me into the hang of prototyping before programming.",
			"type":"Prototyping","key":"prototyping",
			"Keywords":[],
			"urls":{
				"this beast":"http://www.axure.com/"
			}
		},
		{
			"name":"Inkscape",
			"description":"Not many know about Inkscape, but its an amazing alternative to Adobe Illustrator for drawing svg graphics. Not as complicated and powerful, I agree, but very lightweight and has helped me get a lot of shit done. Respect.",
			"type":"Design","key":"design",
			"Keywords":["design"],
			"urls":{
				"Inkscape":"http://inkscape.org/"
			}
		},
		{
			"name":"GIMP",
			"description":"This was the first graphic design tool that I started learning when I did not even know the difference between scalar and vector graphics. I am forever indebted to <b>Rolf Steinort</b> for his brilliant videos on using this powerful tool.",
			"type":"Design","key":"design",
			"Keywords":["design"],
			"urls":{
				"brilliant videos":"http://blog.meetthegimp.org/table-of-contents/"
			}
		},
		{
			"name":"JavaScript",
			"description":"This baby cannot be ignored, at least not anymore. Now that my favorite programming language is making strides in the server side, there's only more love to come in the future. I wrote a few articles back in the day that were used by a reddit javascript study group.",
			"type":"Development","key":"development",
			"Keywords":[],
			"urls":{
				"few articles":"http://mycodefixes.blogspot.in/p/series.html#nakedjavascript",
				"reddit javascript study group":"http://www.reddit.com/r/learnjavascript/comments/1c53ad/learn_js_properly_study_group_how_is_the_first/"
			}
		},
		{
			"name":"React",
			"description":"Reactive programming is relatively new in javascript. However, Reactjs - released by facebook, like many other frameworks has taken the front end developer by storm. At Yahoo, I work on React on a regular basis to build a really cool tablet/deskop interface.",
			"type":"Development","key":"development",
			"Keywords":[],
			"urls":{
				"Reactjs":"http://facebook.github.io/react/",
				"Reactive programming":"http://en.wikipedia.org/wiki/Reactive_programming"
			}
		},
		{
			"name":"jQuery",
			"description":"John Resig is just awesome. I have used jQuery in the past in combination with other frameworks to create both products and prototypes.",
			"type":"Development","key":"development",
			"Keywords":[],
			"urls":{
				"John Resig":"http://ejohn.org/"
			}
		},
		{
			"name":"jQueryUI",
			"description":"Ive mostly used jQuery UI for its slider, draggable, droppable, and tabs components. I also wrote a tutorial on creating your own custom jquery UI widgets!",
			"type":"Development","key":"development",
			"Keywords":[],
			"urls":{
				"slider":"http://jqueryui.com/slider/",
				"draggable":"http://jqueryui.com/draggable/",
				"droppable":"http://jqueryui.com/droppable/",
				"tabs":"http://jqueryui.com/tabs/",
				"a tutorial":"http://mycodefixes.blogspot.com/2010/11/jquery-creating-custom-widget.html"
			}
		}
	]
}
