{
	"headings":[
		{
			"key":"User Experience",
			"keyDesc":"It is more important to deliver the right product than to simply deliver a product. I owe most of my usability/ux expertise to the projects that I did during my Master's program in Human Computer Interaction at Indiana University."
		},
		{
			"key":"Prototyping",
			"keyDesc":"Design before you code. This has now become my motto. Early prototyping helps save significant amount of development time and effort."
		},
		{
			"key":"Design",
			"keyDesc":" I mainly create vector graphics for most of my wireframes and prototypes."
		},
		{
			"key":"Development",
			"keyDesc":"I have spent considerable time learning web development and I use it to my best advantage when I need to create interactive prototypes. The web has become such an exciting new place that its not possible to not get involved in creating for the web."
		},
		{
			"key":"Tools",
			"keyDesc":" There are certain tools that I have grown to love, admire (and hate as well)."
		}
	],
	"skills":[
		{
			"name":"Usability",
			"description":"I am firm believer in the power of compounding. Tiny problems in an interface, if performed repeatedly enough, can compound to create frustrating user experiences. I focus on those tiny problems and get them out of the way. I specialize in conducting Heuristic Evaluation and Cognitive Walkthroughs.",
			"type":"User Experience",
			"Keywords":[],
			"urls":{
				"Heuristic Evaluation":"http://www.nngroup.com/articles/ten-usability-heuristics/",
				"Cognitive Walkthroughs":"http://www.sigchi.org/chi95/proceedings/tutors/jr_bdy.htm"
			}
		},
		{
			"name":"User Studies",
			"description":"The best way to solve a problem is to solve the right problem. User studies like contextual inquiry, interviews and usability testing help bring out hidden flaws and identify opportunities for innovation.",
			"type":"User Experience",
			"Keywords":[],
			"urls":{
				"contextual inquiry":"http://www.usabilitynet.org/tools/contextualinquiry.htm"
			}
		},
		{
			"name":"Wireframing",
			"description":"There comes a times when you have an epiphany and there comes a time when you have to show it to people so that they may see to believe. But you dont write code to do that. You wireframe, throw around ideas, crush some papers before you head on to burning the midnight oil.",
			"type":"User Experience",
			"Keywords":[],
			"urls":{
				"wireframe":"http://en.wikipedia.org/wiki/Website_wireframe"
			}
		},
		{
			"name":"Prototyping",
			"description":"Websites wireframes are good. But sometimes you need more interaction than what a wireframe offers. I have built elaborate interactive paper prototypes(yes, interactive) and have also built prototypes using frameworks like Twitter Bootstrap and jQueryUI.",
			"type":"User Experience",
			"Keywords":[],
			"urls":{
			}
		},
		{
			"name":"Bootstrap",
			"description":"A prototyper's best friend. Ive used both Bootstrap 2.3 and Bootstrap 3.0 for conducting several online research studies at the IU Human Computer Interaction labs",
			"type":"Prototyping",
			"Keywords":[],
			"urls":{
				"Bootstrap 2.3":"http://getbootstrap.com/2.3.2/",
				"Bootstrap 3.0":"http://getbootstrap.com/"
			}
		},
		{
			"name":"Axure",
			"description":"I was introduced to this beast when I joined my HCI program. I used it for a few class projects for creating prototypes. Its a pretty amazing tool and really got me into the hang of prototyping before programming.",
			"type":"Prototyping",
			"Keywords":[],
			"urls":{
				"this beast":"http://www.axure.com/"
			}
		},
		{
			"name":"Inkscape",
			"description":"Not many know about Inkscape, but its an amazing alternative to Adobe Illustrator for drawing svg graphics. Not as complicated and powerful, I agree, but very lightweight and has helped me get a lot of shit done. Respect.",
			"type":"Design",
			"Keywords":["design"],
			"urls":{
				"Inkscape":"http://inkscape.org/"
			}
		},
		{
			"name":"Adobe Illustrator",
			"description":"After a long stint with the Inkscape, I finally decided to learn some Adobe skills with this fantastic tool. And especially with the new HTML 5 canvas, vector graphics are certainly the way to go!",
			"type":"Design",
			"Keywords":["design"],
			"urls":{
				"keyword":"http://www.adobe.com/products/illustrator.html"
			}
		},
		{
			"name":"GIMP",
			"description":"This was the first graphic design tool that I started learning when I did not even know the difference between scalar and vector graphics. I am forever indebted to <b>Rolf Steinort</b> for his brilliant videos on using this powerful tool.",
			"type":"Design",
			"Keywords":["design"],
			"urls":{
				"brilliant videos":"http://blog.meetthegimp.org/table-of-contents/"
			}
		},
		{
			"name":"JavaScript",
			"description":"This baby cannot be ignored, at least not anymore. Now that my favorite programming language is making strides in the server side, there's only more love to come in the future. I wrote a few articles back in the day that were used by a reddit javascript learning group.",
			"type":"Development",
			"Keywords":[],
			"urls":{
				"few articles":"http://mycodefixes.blogspot.in/p/series.html#nakedjavascript",
				"reddit javascript learning group":"http://www.reddit.com/r/learnjavascript/comments/1c53ad/learn_js_properly_study_group_how_is_the_first/"
			}
		},
		{
			"name":"jQuery",
			"description":"John Resig is just awesome. I use jQuery in combination with other frameworks to create both products and prototypes.",
			"type":"Development",
			"Keywords":[],
			"urls":{
				"John Resig":"http://ejohn.org/"
			}
		},
		{
			"name":"jQueryUI",
			"description":"Ive mostly used jQuery UI for its slider, draggable, droppable, and tabs components. I also wrote a tutorial on creating your own custom jquery UI widgets!",
			"type":"Development",
			"Keywords":[],
			"urls":{
				"slider":"http://jqueryui.com/slider/",
				"draggable":"http://jqueryui.com/draggable/",
				"droppable":"http://jqueryui.com/droppable/",
				"tabs":"http://jqueryui.com/tabs/",
				"a tutorial":"http://mycodefixes.blogspot.com/2010/11/jquery-creating-custom-widget.html"
			}
		},
		{
			"name":"Backbonejs",
			"description":"I  have only lately begun to explore this amazing framework. I love the flexibility and structure it provides. I am still experimenting with it and plan to use it in my next project.",
			"type":"Development",
			"Keywords":[],
			"urls":{
				"this amazing framework":"http://backbonejs.org/"
			}
		},
		{
			"name":"Underscorejs",
			"description":"I keep finding more and more use of underscorejs as I tend to find more ways to rapidly prototype. Superb framework.",
			"type":"Development",
			"Keywords":[],
			"urls":{
				"underscorejs":"http://underscorejs.org/"
			}
		},
		{
			"name":"Java",
			"description":"The first programming language that I fell in love with. The second is JavaScript. Java is the language from where OOPS got ingrained into my thinking. <br/>Ain't it fun to code to interfaces? Hell yeah!",
			"type":"Development",
			"Keywords":["server"],
			"urls":{
			}
		},
		{
			"name":"J2EE",
			"description":"Decided to learn JSP's and Servlets just out of my unfathomable curiosity. I never knew it would lead me to two more certification. Did it just to prove to myself that I know that shit at the back of my hand. <br/>I read the entire Sun Specification for EJB 3.0 and JPA back in 2009. That was cool!",
			"type":"Development",
			"Keywords":["server"],
			"urls":{
			}
		},
		{
			"name":"Nodejs",
			"description":"Got a chance to play with this baby during my summer 2013 internship at Yahoo. Used it along with expressjs and dustjs to create the Yahoo finance mobile-web interface.",
			"type":"Development",
			"Keywords":["server"],
			"urls":{
				"this baby":"http://nodejs.org/",
				"expressjs":"http://expressjs.com/",
				"dustjs":"https://github.com/linkedin/dustjs"
			}
		},
		{
			"name":"Nodepad++",
			"description":"I have been using this editor for all my projects since 2009. Oh, and I am an avid Window's user. Lately I have heard some buzz about brackets, but I haven't taken the plunge(yet).",
			"type":"Tools",
			"Keywords":["editor"],
			"urls":{
				"this editor":"http://notepad-plus-plus.org/",
				"brackets":"http://brackets.io/"
			}
		},
		{
			"name":"WinSCP",
			"description":"I have used this tool for remote sycnhronization all throughout my gradaute years and I kinda like the flexibility of options that it offers.",
			"type":"Tools",
			"Keywords":["web"],
			"urls":{
				"this tool":"http://winscp.net/eng/index.php"
			}
		},
		{
			"name":"Dreamweaver",
			"description":"Dreamweaver, I am sorry but - F**K you.",
			"type":"Tools",
			"Keywords":["web"],
			"urls":{
				
			}
		}
	]
}